[
{"title": "This couple left the city life behind to open a tent and breakfast in Hunza\n", "excerpt": "With Khanabadosh Baithak, Ahmed and Baneen curate experiences for travellers who need a break from it all. \n    ", "time": "2019-08-21T08:40:39+05:00"},
{"title": "Editorial: Trump's efforts to mediate the Kashmir issue are much needed\n", "excerpt": "Historically, the Americans have only woken up and rushed to the region when the two neighbours have been on the brink. \n    ", "time": "2019-08-21T08:16:33+05:00"},
{"title": "Editorial: Extension of Gen Bajwa's tenure — expected but still criticised\n", "excerpt": "Surely, the PTI government must try and live up to its own vision of itself as a powerful setup. \n    ", "time": "2019-08-21T08:03:20+05:00"},
{"title": "To ensure that the people of Kashmir get the attention they deserve, Pakistan must lead the way\n", "excerpt": "This requires Pakistan to take on the difficult issues that it has historically ignored. \n    ", "time": "2019-08-21T08:19:22+05:00"},
{"title": "It is time a new approach is taken towards solving the occupied Kashmir issue\n", "excerpt": "The role of the mediator and peace builder is critical. \n    ", "time": "2019-08-21T07:55:59+05:00"},
{"title": "Stocks storm past 30,000-level\n", "excerpt": "Bulls rampaged through the stock market for the second day in succession with the KSE-100 index. \n    ", "time": "2019-08-21T08:39:19+05:00"},
{"title": "FPCCI reiterates demand for refunds payment\n", "excerpt": "“This will lead to achieving the export target set for this fiscal year,” says FPCCI President Daroo Khan Achakzai. \n    ", "time": "2019-08-21T08:38:37+05:00"},
{"title": "Engro earnings jump 51pc\n", "excerpt": "Along with the results, the company announced cash dividend at Rs8 per share. \n    ", "time": "2019-08-21T08:37:42+05:00"},
{"title": "Spooked Trump insists US economy not in trouble\n", "excerpt": "Trump enters the 2020 campaign season facing significant headwinds — except on the economy. \n    ", "time": "2019-08-21T08:36:49+05:00"},
{"title": "Focus on boosting exports, says Razak\n", "excerpt": "Undertaking institutional reforms, documentation of economy, ease of doing business regulation priority for govt. \n    ", "time": "2019-08-21T08:36:00+05:00"},
{"title": "US sanctions on Huawei bite, but who gets hurt?\n", "excerpt": "Chinese technology giant Huawei has yet to feel the full force of US sanctions due to temporary exemptions. \n    ", "time": "2019-08-21T08:34:30+05:00"},
{"title": "PSX in throes of ‘correction’: SECP chief\n", "excerpt": "Vows no compromise on transparency. \n    ", "time": "2019-08-21T08:33:28+05:00"},
{"title": "CAD contracts 73pc in July\n", "excerpt": "This was in line with the downward trend witnessed throughout 2018-19 when the deficit stood lower by 31pc. \n    ", "time": "2019-08-21T08:32:40+05:00"},
{"title": "Second innings for Gen Bajwa\n", "excerpt": "The security situation may be a factor, but there have been more pressing reasons for the extension. \n    ", "time": "2019-08-21T07:12:13+05:00"},
{"title": "UK ‘concerned’ by reports HK consulate employee detained in China\n", "excerpt": "Hong Kong police confirmed they had opened a missing person’s case on Aug 9. \n    ", "time": "2019-08-21T08:37:06+05:00"},
{"title": "Russia has restarted sharing radiation data, says watchdog\n", "excerpt": "In his first comments on the explosion, President Vladimir Putin says that it hasn’t posed any radiation threat.  \n    ", "time": "2019-08-21T08:41:17+05:00"},
{"title": "Facebook launches tool to let users control data flow\n", "excerpt": "The tool is to give clients access to their so-called \"off-Facebook activity\" and give them the option of deleting it. \n    ", "time": "2019-08-21T08:32:48+05:00"},
{"title": "Anti-Assad fighters withdraw from key Idlib area\n", "excerpt": "Turkey’s Foreign Minister Mevlut Cavusoglu says his country has no intention to move the post from Morek.\n \n    ", "time": "2019-08-21T08:29:08+05:00"},
{"title": "Confiscated Beijing skyscraper sold via online auction\n", "excerpt": "More than 145,000 internet users followed the auction, but only two bids were cast. \n    ", "time": "2019-08-21T08:17:48+05:00"},
{"title": "Desperate migrants jump off rescue ship to reach Italy’s shores\n", "excerpt": "Open Arms describes the situation on board as \"out of control\" and \"desperate\". \n    ", "time": "2019-08-21T08:16:45+05:00"},
{"title": "Concussed Smith ruled out of third Test\n", "excerpt": "The 30-year-old was felled by a Jofra Archer bouncer on Saturday in the first innings of the second Test at Lord’s.  \n    ", "time": "2019-08-21T08:43:08+05:00"},
{"title": "Nai Gaj dam construction cost tripled due to delay, Senate panel told\n", "excerpt": "Federal govt blames Sindh govt for financial delays while Sindh claims project revised on account of deferred payments. \n    ", "time": "2019-08-21T08:00:56+05:00"},
{"title": "Tax notices issued to private schools, tuition centres\n", "excerpt": "FBR launches two digital apps for sales tax registration and sales tax invoice verifications.  \n \n    ", "time": "2019-08-21T07:53:24+05:00"},
{"title": "Singapore to begin public test of driverless buses\n", "excerpt": "Consumers will use an app on their phones to book the shuttles. \n    ", "time": "2019-08-21T08:16:05+05:00"},
{"title": "Rohingya Muslims in Bangladesh say they don’t want to return home\n", "excerpt": "Some Rohingya interviewed by officials on Tuesday say they will not return unless Myanmar gives them citizenship.  \n    ", "time": "2019-08-21T08:15:07+05:00"},
{"title": "India finally shares floodwater discharge data\n", "excerpt": "River Sutlej is expected to be in high flood today.   \n    ", "time": "2019-08-21T07:36:10+05:00"},
{"title": "Trump to discuss Kashmir mediation with Modi\n", "excerpt": "\"I think, we are helping (resolve the tense) situation\" between India and Pakistan, says Trump. \n \n    ", "time": "2019-08-21T07:40:54+05:00"},
{"title": "Is govt protecting video tape scandal judge, wonders CJP\n", "excerpt": "The three-judge Supreme Court bench observes it will decide the fate of the petitions within two or three days. \n \n    ", "time": "2019-08-21T07:33:13+05:00"},
{"title": "Cabinet mulls steps to rein in NAB over complaints by businessmen\n", "excerpt": "Dr Firdous Ashiq Awan observes that businessmen are afraid of NAB and are not investing their money. \n    ", "time": "2019-08-21T07:26:35+05:00"},
{"title": "Three reviews to determine Pakistan’s place on FATF list\n", "excerpt": "Pakistan has submitted its compliance report on 27-point action plan committed with the FATF to the Asia-Pacific Group. \n    ", "time": "2019-08-21T07:50:52+05:00"},
{"title": "FM Qureshi expresses hope France will 'play its due role' on Kashmir issue\n", "excerpt": "Briefs French counterpart on \"illegal action by India\"; French President Macron to discuss Kashmir with Modi this week. \n    ", "time": "2019-08-21T01:03:29+05:00"},
{"title": "US urges India to free detainees, restore rights in occupied Kashmir\n", "excerpt": "Trump reiterates offer to mediate the “explosive” situation in Kashmir. \n    ", "time": "2019-08-21T02:22:47+05:00"},
{"title": "Teens swept up in night raids in occupied Kashmir clampdown\n", "excerpt": "A widow has a gun put to her head and is told to \"keep quiet\" by soldiers as they lead her 20-year-old son away. \n    ", "time": "2019-08-20T23:46:53+05:00"},
{"title": "Accountability court rejects Zardari, Talpur's request for 'A' class facilities in jail\n", "excerpt": "The court, however, granted approval for various amenities to be installed or brought for use at their own expense. \n    ", "time": "2019-08-20T21:54:10+05:00"},
{"title": "6 Indian soldiers killed as Pakistan Army responds to cross-LoC firing: ISPR\n", "excerpt": "Firing by Indian troops had killed three civilians, including a seven-year-old boy, in AJK. \n    ", "time": "2019-08-20T23:31:17+05:00"},
{"title": "'IS still strong in some areas': Pompeo says in CBS interview\n", "excerpt": "US state secretary talks about IS, Iran, China and North Korea in wide-ranging interviews. \n    ", "time": "2019-08-20T20:06:50+05:00"},
{"title": "Pakistan to take Kashmir dispute with India to International Court of Justice\n", "excerpt": "“The decision was taken after considering all legal aspects,”  says Foreign Minister Qureshi.\n \n    ", "time": "2019-08-20T20:36:26+05:00"},
{"title": "'I'm here 24/7': Rohingya youths share their stories on social media\n", "excerpt": "Some 30 Rohingya youths have been selected by the World Food Programme for its “Storytellers” project. \n    ", "time": "2019-08-20T18:28:09+05:00"},
{"title": "Firdous seeks nation's support to 'aggressively highlight' Kashmir issue ahead of Modi's UNGA address\n", "excerpt": "Pakistan plans to pursue the matter \"within the legal framework\" if India does not end \"war crimes\" in occupied Kashmir. \n    ", "time": "2019-08-21T07:27:24+05:00"},
{"title": "Hong Kong's leader vows to narrow rifts, but no specifics\n", "excerpt": "Chief Executive Carrie Lam offers no concessions to the protest movement. \n    ", "time": "2019-08-20T17:12:58+05:00"},
{"title": "Huawei dismisses new suspension of 'unjust' US ban\n", "excerpt": "\"Attempts to suppress Huawei's business won't help the United States achieve technological leadership,\" Huawei said.\n \n    ", "time": "2019-08-20T16:50:08+05:00"},
{"title": "UK, EU harden their positions on Brexit as G7 approaches\n", "excerpt": "Irish premier, after a one-hour call with Johnson, said the Brexit deal wouldn’t be renegotiated. \n    ", "time": "2019-08-20T16:48:39+05:00"},
{"title": "Italy's political crisis comes to a head as PM tipped to quit\n", "excerpt": "Political crisis raises concerns about Italian economy, whose debt ratio at 132% of GDP is second-biggest in eurozone. \n    ", "time": "2019-08-20T16:40:48+05:00"},
{"title": "Army chief confirms life sentence for serving major over misuse of authority\n", "excerpt": "The officer has been dismissed from service and sent to jail for life, says ISPR statement. \n    ", "time": "2019-08-20T16:26:31+05:00"},
{"title": "Star batsman Steve Smith ruled out of third Ashes Test after concussion\n", "excerpt": "He was unable to play on the fifth and final day on Sunday as he awoke feeling \"groggy\". \n    ", "time": "2019-08-20T16:24:50+05:00"},
{"title": "PTI's one year: Fixing how we deal with the climate crisis\n", "excerpt": "The planet is going to hell in a hand-basket and no one in Pakistan seems to care beyond a broad policy discourse. \n    ", "time": "2019-08-20T17:45:46+05:00"},
{"title": "'Genocide underway in occupied Kashmir,' warns AJK president\n", "excerpt": "Urges UNSC to take up Indian atrocities and Kashmir's right to self determination in an open session. \n    ", "time": "2019-08-20T15:33:38+05:00"},
{"title": "Hasan Ali's pre-wedding photoshoot might be the cutest thing you'll see today\n", "excerpt": "That is, until his official wedding photos come out; the ceremony is all set to take place today in Dubai. \n    ", "time": "2019-08-20T15:28:25+05:00"},
{"title": "Editorial: In the year ahead, PTI govt must realise that running the economy requires more than loud claims\n", "excerpt": "It took one whole year for the PTI govt to find its feet amid a sinking economy; it must find the rest of its body too. \n    ", "time": "2019-08-20T14:52:11+05:00"},
{"title": "SC reserves verdict on petitions regarding judge Arshad Malik video scandal\n", "excerpt": "Will decide whether to form an inquiry committee or a judicial commission to probe the matter further.  \n    ", "time": "2019-08-20T21:44:30+05:00"},
{"title": "Russia, China say US missile test risks sparking an arms race\n", "excerpt": "US should \"let go of its Cold War mentality\", says Chinese foreign ministry spokesman. \n    ", "time": "2019-08-20T16:33:20+05:00"},
{"title": "Nobel laureate Amartya Sen slams decision to revoke occupied Kashmir's special status\n", "excerpt": "\"That’s how the British ran the country for 200 years,\" says Sen in interview with Indian media.  \n    ", "time": "2019-08-20T14:00:06+05:00"},
{"title": "Petition submitted in LHC to quash FIRs against Hafiz Saeed, others\n", "excerpt": "High court is set to hear the petition submitted by a top JuD leader, Malik Zafar Iqbal, on Thursday. \n    ", "time": "2019-08-20T18:56:05+05:00"},
{"title": "Director Shonali Bose is worried about Zaira Wasim after Article 370 abrogation\n", "excerpt": "Because of the communication blockade in Jammu and Kashmir, the Bollywood filmmaker cannot get in touch with the actor. \n    ", "time": "2019-08-20T13:02:59+05:00"},
{"title": "Indian authorities make more arrests in occupied Kashmir to deter protests\n", "excerpt": "Primary schools remain deserted as parents worried about the safety of their children keep them at home. \n    ", "time": "2019-08-20T12:40:54+05:00"},
{"title": "Every delay in reporting the crime benefits perpetrators of child sexual abuse\n", "excerpt": "Articles 3 and 4 of the Police Order, 2002, mandate the police to protect children.  \n    ", "time": "2019-08-20T12:19:24+05:00"},
{"title": "Besieged Kashmiri neighbourhood in test of wills with India's Modi\n", "excerpt": "\"If the world won't listen to us too, then what should we do? Pick up guns?\" says a 25-year-old resident of Soura. \n    ", "time": "2019-08-20T11:03:03+05:00"},
{"title": "India's Moon probe enters lunar orbit\n", "excerpt": "India is seeking to become just the fourth nation to land a spacecraft on the Moon.  \n    ", "time": "2019-08-20T11:24:45+05:00"},
{"title": "Twitter, Facebook accuse China of Hong Kong discord campaign\n", "excerpt": "1000 suspended accounts \"were deliberately, specifically attempting to sow political discord in HK\" says Twitter. \n    ", "time": "2019-08-20T17:15:01+05:00"},
{"title": "Zakir Naik apologises to Malaysians for racial remarks\n", "excerpt": "Naik has permanent residency in Malaysia and several ministers called for his expulsion after his controversial remarks. \n    ", "time": "2019-08-20T10:50:09+05:00"},
{"title": "Is govt protecting video tape scandal judge, wonders CJP\n", "excerpt": "The three-judge Supreme Court bench observes it will decide the fate of the petitions within two or three days. \n \n    ", "time": "2019-08-21T07:33:13+05:00"},
{"title": "Nai Gaj dam construction cost tripled due to delay, Senate panel told\n", "excerpt": "Federal govt blames Sindh govt for financial delays while Sindh claims project revised on account of deferred payments. \n    ", "time": "2019-08-21T08:00:56+05:00"},
{"title": "Tax notices issued to private schools, tuition centres\n", "excerpt": "FBR launches two digital apps for sales tax registration and sales tax invoice verifications.  \n \n    ", "time": "2019-08-21T07:53:24+05:00"},
{"title": "India finally shares floodwater discharge data\n", "excerpt": "River Sutlej is expected to be in high flood today.   \n    ", "time": "2019-08-21T07:36:10+05:00"},
{"title": "Cabinet mulls steps to rein in NAB over complaints by businessmen\n", "excerpt": "Dr Firdous Ashiq Awan observes that businessmen are afraid of NAB and are not investing their money. \n    ", "time": "2019-08-21T07:26:35+05:00"},
{"title": "Petition submitted in LHC to quash FIRs against Hafiz Saeed, others\n", "excerpt": "High court is set to hear the petition submitted by a top JuD leader, Malik Zafar Iqbal, on Thursday. \n    ", "time": "2019-08-20T18:56:05+05:00"},
{"title": "SC reserves verdict on petitions regarding judge Arshad Malik video scandal\n", "excerpt": "Will decide whether to form an inquiry committee or a judicial commission to probe the matter further.  \n    ", "time": "2019-08-20T21:44:30+05:00"},
{"title": "‘CPEC Authority’ being set up for timely completion of projects: PM\n", "excerpt": "\"The completion of CPEC will not only benefit Pakistan and China, but also the entire region,\" says the prime minister. \n    ", "time": "2019-08-20T08:17:25+05:00"},
{"title": "Pakistan to take Kashmir dispute with India to International Court of Justice\n", "excerpt": "“The decision was taken after considering all legal aspects,”  says Foreign Minister Qureshi.\n \n    ", "time": "2019-08-20T20:36:26+05:00"},
{"title": "Editorial: Extension of Gen Bajwa's tenure — expected but still criticised\n", "excerpt": "Surely, the PTI government must try and live up to its own vision of itself as a powerful setup. \n    ", "time": "2019-08-21T08:03:20+05:00"},
{"title": "Second innings for Gen Bajwa\n", "excerpt": "The security situation may be a factor, but there have been more pressing reasons for the extension. \n    ", "time": "2019-08-21T07:12:13+05:00"},
{"title": "'Genocide underway in occupied Kashmir,' warns AJK president\n", "excerpt": "Urges UNSC to take up Indian atrocities and Kashmir's right to self determination in an open session. \n    ", "time": "2019-08-20T15:33:38+05:00"},
{"title": "Pakistan alarmed at Indian attitude over water treaty\n", "excerpt": "Vawda says under the accord New Delhi is obligated to provide information about 'extraordinary flood' to Pakistan. \n    ", "time": "2019-08-20T07:40:49+05:00"},
{"title": "6 Indian soldiers killed as Pakistan Army responds to cross-LoC firing: ISPR\n", "excerpt": "Firing by Indian troops had killed three civilians, including a seven-year-old boy, in AJK. \n    ", "time": "2019-08-20T23:31:17+05:00"},
{"title": "Accountability court rejects Zardari, Talpur's request for 'A' class facilities in jail\n", "excerpt": "The court, however, granted approval for various amenities to be installed or brought for use at their own expense. \n    ", "time": "2019-08-20T21:54:10+05:00"},
{"title": "Sindh chief secretary cancels Chinese firm’s garbage-lifting contract over ‘poor performance’\n", "excerpt": "Directives have been issued to place additional 4,000 dustbins across the city within three days. \n    ", "time": "2019-08-20T08:54:47+05:00"},
{"title": "Army chief confirms life sentence for serving major over misuse of authority\n", "excerpt": "The officer has been dismissed from service and sent to jail for life, says ISPR statement. \n    ", "time": "2019-08-20T16:26:31+05:00"},
{"title": "Suspects booked for sectarian violence in last 10 years to be arrested\n", "excerpt": "CPO also directed them to ensure daily attendance of all fourth schedulers at the relevant police stations.    \n    ", "time": "2019-08-20T09:03:27+05:00"},
{"title": "Drive against open littering in city launched officially\n", "excerpt": "The Blue Jacket Movement officially commenced at Boat Basin in Clifton on Monday. \n \n    ", "time": "2019-08-20T08:58:52+05:00"},
{"title": "PM calls meeting to take stock of polio situation in light of continuous rise in cases\n", "excerpt": "Provincial chief secretaries, international organisations’ representatives to attend. \n    ", "time": "2019-08-20T09:02:22+05:00"},
{"title": "Plans to celebrate Baba Nanak’s birth anniversary in grand way\n", "excerpt": "The Punjab government is keenly emphasising religious tourism. \n    ", "time": "2019-08-20T09:01:31+05:00"},
{"title": "CAA bifurcation ruffles air traffic controllers’ feathers\n", "excerpt": "PM Imran has approved bifurcation of CAA into two divisions on the basis of regulatory functions and airport services. \n    ", "time": "2019-08-20T09:00:13+05:00"},
{"title": "Hasan Ali's pre-wedding photoshoot might be the cutest thing you'll see today\n", "excerpt": "That is, until his official wedding photos come out; the ceremony is all set to take place today in Dubai. \n    ", "time": "2019-08-20T15:28:25+05:00"},
{"title": "Qaim gets pre-arrest bail in fake accounts case\n", "excerpt": "Qaim Ali Shah has been granted pre-arrest interim bail against Rs500,000 surety bonds till August 29.  \n    ", "time": "2019-08-20T08:10:18+05:00"},
{"title": "Every delay in reporting the crime benefits perpetrators of child sexual abuse\n", "excerpt": "Articles 3 and 4 of the Police Order, 2002, mandate the police to protect children.  \n    ", "time": "2019-08-20T12:19:24+05:00"},
{"title": "Sindh govt assures PTI lawmakers of probe into police action against protesting nurses\n", "excerpt": "The assurance was given during the Sindh Assembly session presided over by Speaker Agha Siraj Durrani. \n    ", "time": "2019-08-20T08:57:18+05:00"},
{"title": "This media platform wants to be the premium digital content creator from Pakistan\n", "excerpt": "Dot Republic Media already has 6 short films ready to release starring some of your favourite actors \n    ", "time": "2019-08-20T10:00:00+05:00"},
{"title": "MPC accuses govt of ‘sellout’ on Kashmir\n", "excerpt": "PPP chairman Bilawal Bhutto-Zardari and PML-N president Shahbaz Sharif did not attend the conference. \n    ", "time": "2019-08-20T07:49:22+05:00"},
{"title": "Furniture, books 'torched' at girls school in Gilgit-Baltistan's Diamer\n", "excerpt": "Police find no indication of a short circuit having caused the blaze; officer suspects miscreants' involvement. \n    ", "time": "2019-08-19T23:18:55+05:00"},
{"title": "UAE business tycoon Lootah turns approver against Zardari\n", "excerpt": "The top businessman is one of the accused persons in the fake accounts case. \n    ", "time": "2019-08-20T07:45:40+05:00"},
{"title": "Seven-year-old village boy injured in Indian firing dies\n", "excerpt": "The civilian death toll in the Indian firing over the last 24 hours has risen to three, officials and residents say. \n    ", "time": "2019-08-20T22:11:28+05:00"},
{"title": "SJC quashes misconduct reference against Justice Isa for writing letters to president\n", "excerpt": "The matter of Justice Isa writing to President Alvi does not constitute misconduct sufficient for his removal: council. \n    ", "time": "2019-08-20T07:49:37+05:00"},
{"title": "200 accounts suspended over Kashmir reported to Twitter\n", "excerpt": "Twitter refutes charge of bias, says no one is above its rules. \n    ", "time": "2019-08-20T08:03:47+05:00"},
{"title": "Flood alert issued for River Sutlej, Indus after India releases water 'without preschedule'\n", "excerpt": "Punjab Chief Minister Usman Buzdar has summoned an emergency meeting to discuss the flood alert for River Sutlej. \n    ", "time": "2019-08-20T01:36:03+05:00"},
{"title": "Kashmir issue on top of today’s multiparty conference agenda\n", "excerpt": "Maulana Fazlur Rehman will chair the multiparty conference.\n \n    ", "time": "2019-08-19T07:58:46+05:00"},
{"title": "Tax notices issued to private schools, tuition centres\n", "excerpt": "FBR launches two digital apps for sales tax registration and sales tax invoice verifications.  \n \n    ", "time": "2019-08-21T07:53:24+05:00"},
{"title": "Three reviews to determine Pakistan’s place on FATF list\n", "excerpt": "Pakistan has submitted its compliance report on 27-point action plan committed with the FATF to the Asia-Pacific Group. \n    ", "time": "2019-08-21T07:50:52+05:00"},
{"title": "CAD contracts 73pc in July\n", "excerpt": "This was in line with the downward trend witnessed throughout 2018-19 when the deficit stood lower by 31pc. \n    ", "time": "2019-08-21T08:32:40+05:00"},
{"title": "Focus on boosting exports, says Razak\n", "excerpt": "Undertaking institutional reforms, documentation of economy, ease of doing business regulation priority for govt. \n    ", "time": "2019-08-21T08:36:00+05:00"},
{"title": "Spooked Trump insists US economy not in trouble\n", "excerpt": "Trump enters the 2020 campaign season facing significant headwinds — except on the economy. \n    ", "time": "2019-08-21T08:36:49+05:00"},
{"title": "PSX in throes of ‘correction’: SECP chief\n", "excerpt": "Vows no compromise on transparency. \n    ", "time": "2019-08-21T08:33:28+05:00"},
{"title": "Stocks storm past 30,000-level\n", "excerpt": "Bulls rampaged through the stock market for the second day in succession with the KSE-100 index. \n    ", "time": "2019-08-21T08:39:19+05:00"},
{"title": "FPCCI reiterates demand for refunds payment\n", "excerpt": "“This will lead to achieving the export target set for this fiscal year,” says FPCCI President Daroo Khan Achakzai. \n    ", "time": "2019-08-21T08:38:37+05:00"},
{"title": "Engro earnings jump 51pc\n", "excerpt": "Along with the results, the company announced cash dividend at Rs8 per share. \n    ", "time": "2019-08-21T08:37:42+05:00"},
{"title": "UAE business tycoon Lootah turns approver against Zardari\n", "excerpt": "The top businessman is one of the accused persons in the fake accounts case. \n    ", "time": "2019-08-20T07:45:40+05:00"},
{"title": "Huawei dismisses new suspension of 'unjust' US ban\n", "excerpt": "\"Attempts to suppress Huawei's business won't help the United States achieve technological leadership,\" Huawei said.\n \n    ", "time": "2019-08-20T16:50:08+05:00"},
{"title": "UK, EU harden their positions on Brexit as G7 approaches\n", "excerpt": "Irish premier, after a one-hour call with Johnson, said the Brexit deal wouldn’t be renegotiated. \n    ", "time": "2019-08-20T16:48:39+05:00"},
{"title": "‘CPEC Authority’ being set up for timely completion of projects: PM\n", "excerpt": "\"The completion of CPEC will not only benefit Pakistan and China, but also the entire region,\" says the prime minister. \n    ", "time": "2019-08-20T08:17:25+05:00"},
{"title": "Johnson tells Germany and France: do a Brexit deal\n", "excerpt": "\"We will be ready to come out on Oct 31 — deal or no deal,\" Johnson tells reporters in Truro, southwest England.\n \n    ", "time": "2019-08-20T08:45:26+05:00"},
{"title": "US sanctions on Huawei bite, but who gets hurt?\n", "excerpt": "Chinese technology giant Huawei has yet to feel the full force of US sanctions due to temporary exemptions. \n    ", "time": "2019-08-21T08:34:30+05:00"},
{"title": "Big industry contracts 3.6pc in FY19\n", "excerpt": "In June, the last month of the outgoing fiscal year, the big industry posted a negative growth of 5.05pc. \n    ", "time": "2019-08-20T08:21:45+05:00"},
{"title": "Stocks bounce back with a 798-point rally\n", "excerpt": "“One swallow does not make a summer,” says a veteran. \n    ", "time": "2019-08-20T08:31:45+05:00"},
{"title": "Car sales plunge by 42pc in July\n", "excerpt": "The key contributor to this lower production was the closure of production by Honda Atlas Cars. \n    ", "time": "2019-08-20T08:22:41+05:00"},
{"title": "Tough measures hampering dollar buying\n", "excerpt": "Currency dealers said the dollar buying has drastically dropped these days due to strict documentation. \n    ", "time": "2019-08-20T08:23:08+05:00"},
{"title": "Regulations for employees’ contributory funds notified\n", "excerpt": "The regulations do not apply to a pension funds which are governed under Voluntary Pension Systems Rules 2005.  \n    ", "time": "2019-08-20T08:28:36+05:00"},
{"title": "India eases condition for shadow lenders\n", "excerpt": "The non-banking finance companies, also known as shadow lenders, have been battling a credit crunch since 2018. \n    ", "time": "2019-08-20T08:26:23+05:00"},
{"title": "Greek PM on EU tour to soften fiscal targets\n", "excerpt": "Mitsotakis will begin his meetings with a trip to Paris on Thursday. \n    ", "time": "2019-08-20T08:24:32+05:00"},
{"title": "US grants Huawei another 90 days to buy from American suppliers\n", "excerpt": "Authorities say the extension is intended to afford consumers necessary time to transition away from Huawei equipment. \n    ", "time": "2019-08-19T23:02:25+05:00"},
{"title": "German economy could continue to shrink: Bundesbank report\n", "excerpt": "Central bank of Federal Republic of Germany's report suggests that euro zone's biggest economy is now in a recession. \n    ", "time": "2019-08-19T16:40:31+05:00"},
{"title": "US economists expect recession in 2020 or 2021: survey\n", "excerpt": "Economists skeptical about a resolution to Trump's trade wars, although 64pc said a \"superficial agreement is possible\". \n    ", "time": "2019-08-19T21:58:12+05:00"},
{"title": "1,320MW coal-fired Hub power plant commissioned\n", "excerpt": "The plant will be set up by the China Power Hub Generation Company (CPHGC) under the CPEC project. \n    ", "time": "2019-08-19T07:01:51+05:00"},
{"title": "NAB shouldn’t move against bureaucrats on its own: task forces\n", "excerpt": "Supervisory bodies recommended at federal, provincial levels to decide if there is sufficient evidence against suspects. \n    ", "time": "2019-08-19T09:04:13+05:00"},
{"title": "Production from two major gas fields stopped\n", "excerpt": "The output from another was drastically cut to ensure smooth flow of expensive, imported LNG into the gas network. \n    ", "time": "2019-08-19T07:33:02+05:00"},
{"title": "Trump dismisses worries of recession, says economy is strong\n", "excerpt": "\"I don't think we're having a recession,\" Trump tells reporters. \n    ", "time": "2019-08-19T11:17:22+05:00"},
{"title": "Inflation may erode PTI’s political capital\n", "excerpt": "The government has so far not been able to keep inflation in check even for people in the lowest income group. \n    ", "time": "2019-08-19T08:10:46+05:00"},
{"title": "Politics creating water shortages\n", "excerpt": "Successive governments have allowed direct outlets to canals as political favours. \n    ", "time": "2019-08-19T08:39:44+05:00"},
{"title": "Pests of pesticide trade\n", "excerpt": "‘The only drug-testing laboratory in Punjab’s capital is part of the problem rather than solution’  \n    ", "time": "2019-08-19T07:02:16+05:00"},
{"title": "Millennial money: how to outsmart smartphone scammers\n", "excerpt": "Your smartphone is your confidante, your hand-held connection to the world and one of your biggest vulnerabilities. \n    ", "time": "2019-08-21T08:11:13+05:00"},
{"title": "CBS, Viacom to reunite as media giants bulk up for streaming\n", "excerpt": "ViacomCBS will be ‘one of only a few companies with the breadth and depth of content'. \n    ", "time": "2019-08-19T08:15:43+05:00"},
{"title": "The downside of having a stability programme\n", "excerpt": "Pakistan cannot afford a protracted economic slowdown. \n    ", "time": "2019-08-21T08:13:14+05:00"},
{"title": "Trump to discuss Kashmir mediation with Modi\n", "excerpt": "\"I think, we are helping (resolve the tense) situation\" between India and Pakistan, says Trump. \n \n    ", "time": "2019-08-21T07:40:54+05:00"},
{"title": "Rohingya Muslims in Bangladesh say they don’t want to return home\n", "excerpt": "Some Rohingya interviewed by officials on Tuesday say they will not return unless Myanmar gives them citizenship.  \n    ", "time": "2019-08-21T08:15:07+05:00"},
{"title": "Anti-Assad fighters withdraw from key Idlib area\n", "excerpt": "Turkey’s Foreign Minister Mevlut Cavusoglu says his country has no intention to move the post from Morek.\n \n    ", "time": "2019-08-21T08:29:08+05:00"},
{"title": "Desperate migrants jump off rescue ship to reach Italy’s shores\n", "excerpt": "Open Arms describes the situation on board as \"out of control\" and \"desperate\". \n    ", "time": "2019-08-21T08:16:45+05:00"},
{"title": "UK ‘concerned’ by reports HK consulate employee detained in China\n", "excerpt": "Hong Kong police confirmed they had opened a missing person’s case on Aug 9. \n    ", "time": "2019-08-21T08:37:06+05:00"},
{"title": "Singapore to begin public test of driverless buses\n", "excerpt": "Consumers will use an app on their phones to book the shuttles. \n    ", "time": "2019-08-21T08:16:05+05:00"},
{"title": "Russia has restarted sharing radiation data, says watchdog\n", "excerpt": "In his first comments on the explosion, President Vladimir Putin says that it hasn’t posed any radiation threat.  \n    ", "time": "2019-08-21T08:41:17+05:00"},
{"title": "Confiscated Beijing skyscraper sold via online auction\n", "excerpt": "More than 145,000 internet users followed the auction, but only two bids were cast. \n    ", "time": "2019-08-21T08:17:48+05:00"},
{"title": "US urges India to free detainees, restore rights in occupied Kashmir\n", "excerpt": "Trump reiterates offer to mediate the “explosive” situation in Kashmir. \n    ", "time": "2019-08-21T02:22:47+05:00"},
{"title": "Facebook launches tool to let users control data flow\n", "excerpt": "The tool is to give clients access to their so-called \"off-Facebook activity\" and give them the option of deleting it. \n    ", "time": "2019-08-21T08:32:48+05:00"},
{"title": "India finally shares floodwater discharge data\n", "excerpt": "River Sutlej is expected to be in high flood today.   \n    ", "time": "2019-08-21T07:36:10+05:00"},
{"title": "FM Qureshi expresses hope France will 'play its due role' on Kashmir issue\n", "excerpt": "Briefs French counterpart on \"illegal action by India\"; French President Macron to discuss Kashmir with Modi this week. \n    ", "time": "2019-08-21T01:03:29+05:00"},
{"title": "'IS still strong in some areas': Pompeo says in CBS interview\n", "excerpt": "US state secretary talks about IS, Iran, China and North Korea in wide-ranging interviews. \n    ", "time": "2019-08-20T20:06:50+05:00"},
{"title": "Editorial: Trump's efforts to mediate the Kashmir issue are much needed\n", "excerpt": "Historically, the Americans have only woken up and rushed to the region when the two neighbours have been on the brink. \n    ", "time": "2019-08-21T08:16:33+05:00"},
{"title": "UK, EU harden their positions on Brexit as G7 approaches\n", "excerpt": "Irish premier, after a one-hour call with Johnson, said the Brexit deal wouldn’t be renegotiated. \n    ", "time": "2019-08-20T16:48:39+05:00"},
{"title": "Pakistan to take Kashmir dispute with India to International Court of Justice\n", "excerpt": "“The decision was taken after considering all legal aspects,”  says Foreign Minister Qureshi.\n \n    ", "time": "2019-08-20T20:36:26+05:00"},
{"title": "Hong Kong's leader vows to narrow rifts, but no specifics\n", "excerpt": "Chief Executive Carrie Lam offers no concessions to the protest movement. \n    ", "time": "2019-08-20T17:12:58+05:00"},
{"title": "Huawei dismisses new suspension of 'unjust' US ban\n", "excerpt": "\"Attempts to suppress Huawei's business won't help the United States achieve technological leadership,\" Huawei said.\n \n    ", "time": "2019-08-20T16:50:08+05:00"},
{"title": "To ensure that the people of Kashmir get the attention they deserve, Pakistan must lead the way\n", "excerpt": "This requires Pakistan to take on the difficult issues that it has historically ignored. \n    ", "time": "2019-08-21T08:19:22+05:00"},
{"title": "It is time a new approach is taken towards solving the occupied Kashmir issue\n", "excerpt": "The role of the mediator and peace builder is critical. \n    ", "time": "2019-08-21T07:55:59+05:00"},
{"title": "Italy's political crisis comes to a head as PM tipped to quit\n", "excerpt": "Political crisis raises concerns about Italian economy, whose debt ratio at 132% of GDP is second-biggest in eurozone. \n    ", "time": "2019-08-20T16:40:48+05:00"},
{"title": "Russia, China say US missile test risks sparking an arms race\n", "excerpt": "US should \"let go of its Cold War mentality\", says Chinese foreign ministry spokesman. \n    ", "time": "2019-08-20T16:33:20+05:00"},
{"title": "Indian authorities make more arrests in occupied Kashmir to deter protests\n", "excerpt": "Primary schools remain deserted as parents worried about the safety of their children keep them at home. \n    ", "time": "2019-08-20T12:40:54+05:00"},
{"title": "Zakir Naik apologises to Malaysians for racial remarks\n", "excerpt": "Naik has permanent residency in Malaysia and several ministers called for his expulsion after his controversial remarks. \n    ", "time": "2019-08-20T10:50:09+05:00"},
{"title": "India's Moon probe enters lunar orbit\n", "excerpt": "India is seeking to become just the fourth nation to land a spacecraft on the Moon.  \n    ", "time": "2019-08-20T11:24:45+05:00"},
{"title": "Twitter, Facebook accuse China of Hong Kong discord campaign\n", "excerpt": "1000 suspended accounts \"were deliberately, specifically attempting to sow political discord in HK\" says Twitter. \n    ", "time": "2019-08-20T17:15:01+05:00"},
{"title": "Aid cut improved ties with Pakistan: Trump\n", "excerpt": "\"So, what happened: I cut back $1.3 billion. We have a better relationship now,\" says Trump. \n    ", "time": "2019-08-20T17:48:49+05:00"},
{"title": "'I'm here 24/7': Rohingya youths share their stories on social media\n", "excerpt": "Some 30 Rohingya youths have been selected by the World Food Programme for its “Storytellers” project. \n    ", "time": "2019-08-20T18:28:09+05:00"},
{"title": "‘Some things’ about Afghanistan to be announced soon: Trump\n", "excerpt": "Trump, however, did not offer details of this announcement.\n \n    ", "time": "2019-08-20T08:23:56+05:00"},
{"title": "Malaysia quizzes Zakir Naik as pressure mounts\n", "excerpt": "Zakir Naik left India in 2016 and moved to largely Muslim Malaysia, where he was granted permanent residency. \n    ", "time": "2019-08-20T08:28:06+05:00"},
{"title": "Sudan’s Bashir ‘got $90m from Saudi royals’, official tells court\n", "excerpt": "The former president sat in a metal cage wearing a traditional white gown in the Khartoum court. \n    ", "time": "2019-08-20T08:25:14+05:00"},
{"title": "Air strikes target Turkish convoy in Syria\n", "excerpt": "The Turkish Defence Ministry gives no word on Turkish casualties. \n    ", "time": "2019-08-20T08:29:02+05:00"},
{"title": "Trump stresses need to reduce India-Pakistan tension in phone calls to PM Imran, Modi\n", "excerpt": "\"A tough situation, but good conversations!\" says Trump. \n    ", "time": "2019-08-20T18:37:25+05:00"},
{"title": "Director Shonali Bose is worried about Zaira Wasim after Article 370 abrogation\n", "excerpt": "Because of the communication blockade in Jammu and Kashmir, the Bollywood filmmaker cannot get in touch with the actor. \n    ", "time": "2019-08-20T13:02:59+05:00"},
{"title": "Global network’s nuclear sensors went offline after mystery blast\n", "excerpt": "The Russian Defence Ministry, which operates the two stations, did not immediately reply to a request for comment.\n \n    ", "time": "2019-08-20T08:39:45+05:00"},
{"title": "Concussed Smith ruled out of third Test\n", "excerpt": "The 30-year-old was felled by a Jofra Archer bouncer on Saturday in the first innings of the second Test at Lord’s.  \n    ", "time": "2019-08-21T08:43:08+05:00"},
{"title": "Star batsman Steve Smith ruled out of third Ashes Test after concussion\n", "excerpt": "He was unable to play on the fifth and final day on Sunday as he awoke feeling \"groggy\". \n    ", "time": "2019-08-20T16:24:50+05:00"},
{"title": "Azhar Mahmood feels coaching staff deserved chance to clarify position\n", "excerpt": "Azhar admitted fast bowler Mohammad Hasnain’s selection in the World Cup squad was a mistake. \n    ", "time": "2019-08-20T08:41:53+05:00"},
{"title": "Sharjeel apologises as PCB waives ban sentence\n", "excerpt": "Sharjeel was suspended from national and international cricket for five years by the PCB in 2017. \n    ", "time": "2019-08-20T08:42:36+05:00"},
{"title": "Mandatory neck guards not far off after Smith blow\n", "excerpt": "Australia have been at the forefront of pressing for better safety measures for players. \n    ", "time": "2019-08-20T08:43:23+05:00"},
{"title": "Archer’s sensational debut changes complexion of Ashes series\n", "excerpt": "The times on the speed gun kept on rising. \n \n    ", "time": "2019-08-20T08:40:17+05:00"},
{"title": "Medvedev breaks into top five at last\n", "excerpt": "The 23-year-old became the first Russian player in history to win a Masters title. \n    ", "time": "2019-08-20T08:35:02+05:00"},
{"title": "Prince Albert outpaces rivals to clinch Jashn-e-Azadi Cup\n", "excerpt": "The son of Denmark-bred sire Chapter One backed at 3-2 beat filly Sparking by two lengths. \n    ", "time": "2019-08-20T08:37:58+05:00"},
{"title": "PSG leave out Neymar again on way to shock Rennes defeat\n", "excerpt": "The visitors were gifted the opener when Edinson Cavani tapped in after a defensive mix-up. \n    ", "time": "2019-08-20T08:38:23+05:00"},
{"title": "Leipzig crush Union 4-0 to spoil newcomers’ Bundesliga debut\n", "excerpt": "RB Leipzig spoiled hosts Union Berlin’s .Bundesliga debut on Sunday. \n    ", "time": "2019-08-20T08:39:10+05:00"},
{"title": "Olympic gold medallist Zakir Hussain passes away at 85\n", "excerpt": "Hussain's funeral prayers will be carried out at his home town in Wah Cantt. \n    ", "time": "2019-08-19T14:36:36+05:00"},
{"title": "Mandatory neck guards 'not far away' after Smith felled by Archer\n", "excerpt": "Australia have been at the forefront of pressing for better safety measures after the death of Phillip Hughes. \n    ", "time": "2019-08-19T13:38:48+05:00"},
{"title": "Archer, Stokes give England advantage in Lord’s Test\n", "excerpt": "Australia were struggling at 46-2 in their second innings at tea on a compelling final day of the second Test. \n    ", "time": "2019-08-19T08:31:25+05:00"},
{"title": "ACA blasts English fans for booing injured Smith\n", "excerpt": "Smith was eventually able to walk off the field for concussion checks to a standing ovation. \n    ", "time": "2019-08-19T08:34:35+05:00"},
{"title": "Afghanistan board suspends Shahzad for one year\n", "excerpt": "Shahzad’s suspension stems from his breach of policy that requires players to seek permission before travelling abroad. \n    ", "time": "2019-08-19T08:36:03+05:00"},
{"title": "Chelsea held by Leicester, Sheffield United win\n", "excerpt": "Chelsea raced into a quick lead when the 20 year-old Mount stole the ball from a dallying Ndidi. \n    ", "time": "2019-08-19T08:32:08+05:00"},
{"title": "Australia hold out for second Test draw against England as concussed Smith sidelined\n", "excerpt": "Australia were 154-6 at the close, given a stiff target of 267 in 48 overs when England captain Joe Root declared. \n    ", "time": "2019-08-19T00:37:49+05:00"},
{"title": "New Zealand rugby team says World Cup more important than top ranking\n", "excerpt": "“We just need to get ourselves in the right frame of mind to go to the World Cup and win that,” says team coach. \n    ", "time": "2019-08-18T16:19:22+05:00"},
{"title": "Sri Lanka may consider  playing a Test on Pakistan  soil in October\n", "excerpt": "According to a report by *ESPNcricinfo*, the security delegation gave SLC “very positive feedback” upon its return. \n    ", "time": "2019-08-18T09:59:13+05:00"},
{"title": "Liverpool extend perfect start, Aubameyang inspires Arsenal as Pukki hits hat-trick\n", "excerpt": "The Reds’ confident start to the season puts pressure on champions Manchester City to respond with a second win. \n    ", "time": "2019-08-18T10:03:10+05:00"},
{"title": "Kaleemullah, Nasir Ali to join PHF selection committee\n", "excerpt": "The PHF had announced a four-member committee headed by Olympian Manzoor Junior. \n    ", "time": "2019-08-18T10:05:37+05:00"},
{"title": "Smith holds firm as Australia frustrate England in second Ashes Test\n", "excerpt": "Australia were 155-5 at lunch, having lost just one wicket in the session; hosts England scored 258 in first innings. \n    ", "time": "2019-08-17T18:10:19+05:00"},
{"title": "BD bring in Domingo as new head coach\n", "excerpt": "The 44-year-old has agreed to a two-year term with the BCB and is expected to arrive in Dhaka on Wednesday. \n    ", "time": "2019-08-18T10:12:48+05:00"},
{"title": "Foreign coaches cannot improve Pakistan cricket: Sarfraz Nawaz\n", "excerpt": "Former pacer also wants PCB to allow departmental teams to continue playing at least in one-day and T20 events. \n    ", "time": "2019-08-17T10:04:06+05:00"},
{"title": "Australia slump before rain cuts short play in Lord’s Test\n", "excerpt": "Australia lost three wickets for 11 runs en route to slumping to 80-4. \n    ", "time": "2019-08-17T10:00:35+05:00"},
{"title": "Battling Watling revives NZ hopes\n", "excerpt": "New Zealand, who trailed Sri Lanka by 18 runs in the first innings, finished on 195-7. \n    ", "time": "2019-08-17T10:00:53+05:00"},
{"title": "Big win sets Wolves up for Europa League playoff with Torino\n", "excerpt": "The winner of the home and away legs on August 22 and 29 will progress to the group stage.   \n    ", "time": "2019-08-17T10:04:33+05:00"},
{"title": "Shastri wins close race to stay as India head coach\n", "excerpt": "Former India players Lalchand Rajput and Robin Singh were also short-listed candidates.   \n    ", "time": "2019-08-17T10:02:02+05:00"},
{"title": "Back problem hampers Morgan’s desire for second World Cup success\n", "excerpt": "The 32-year-old Irishman had problems with his back during the drawn-out World Cup campaign. \n    ", "time": "2019-08-17T10:02:47+05:00"},
{"title": "Misbah likely to get dual role of chief selector  and head coach\n", "excerpt": "PCB set to introduce a new model of domestic cricket soon. \n    ", "time": "2019-08-16T09:37:09+05:00"},
{"title": "Hazlewood strikes on Ashes return to leave England wobbling\n", "excerpt": "After rain washed out Wednesday’s first day, Australia captain Tim Paine decided to field first after winning the toss. \n    ", "time": "2019-08-16T09:42:46+05:00"},
{"title": "Spinner Patel stars as SL lose ground in Galle Test\n", "excerpt": "Sri Lanka trail New Zealand by 22 runs with three first-innings wickets remaining. \n    ", "time": "2019-08-16T09:44:14+05:00"},
{"title": "SA cricket director seeks Guardiola inspiration\n", "excerpt": "Nkwe, 36, tells a press conference on Thursday that he was a big fan of Manchester City manager Guardiola. \n    ", "time": "2019-08-16T09:47:28+05:00"},
{"title": "King Kohli leads India to victory and overshadows Gayle swansong\n", "excerpt": "While Kohli illuminated the gathering gloom in at the end of the match, it was Gayle who stole the show at the start.  \n    ", "time": "2019-08-15T10:36:27+05:00"},
{"title": "Liverpool beats Chelsea on penalties to lift Super Cup\n", "excerpt": "Adrian makes crucial save with his leg to deny Tammy Abraham and give his team a 5-4 win. \n    ", "time": "2019-08-15T10:31:36+05:00"},
{"title": "Editorial: Trump's efforts to mediate the Kashmir issue are much needed\n", "excerpt": null, "time": null},
{"title": "Editorial: Extension of Gen Bajwa's tenure — expected but still criticised\n", "excerpt": null, "time": null},
{"title": "It is time a new approach is taken towards solving the occupied Kashmir issue\n", "excerpt": null, "time": null},
{"title": "This couple left the city life behind to open a tent and breakfast in Hunza\n", "excerpt": null, "time": null},
{"title": "The downside of having a stability programme\n", "excerpt": null, "time": null},
{"title": "Patriotism vs commercial interests\n", "excerpt": null, "time": null},
{"title": "Flood alert issued for River Sutlej, Indus after India releases water 'without preschedule'\n", "excerpt": null, "time": null},
{"title": "Trump stresses need to reduce India-Pakistan tension in phone calls to PM Imran, Modi\n", "excerpt": null, "time": null},
{"title": "Modi’s next move\n", "excerpt": null, "time": null},
{"title": "Pakistan takes up suspension of accounts 'posting in support of Kashmir' with Twitter, Facebook\n", "excerpt": null, "time": null},
{"title": "World must wake up to India’s nuke threat, says PM\n", "excerpt": null, "time": null},
{"title": "Army chief Gen Bajwa's tenure extended for another 3 years\n", "excerpt": null, "time": null},
{"title": "'World must seriously consider safety, security of India's nuclear arsenal in control of fascist Modi'\n", "excerpt": null, "time": null},
{"title": "UNSC Kashmir moot gives lie to Indian claim\n", "excerpt": null, "time": null},
{"title": "Patriotism vs commercial interests\n", "excerpt": null, "time": null},
{"title": "'UNSC, OIC have responded positively to Pakistan's call,' says FM Qureshi\n", "excerpt": null, "time": null},
{"title": "Flood alert issued for River Sutlej, Indus after India releases water 'without preschedule'\n", "excerpt": null, "time": null},
{"title": "Trump stresses need to reduce India-Pakistan tension in phone calls to PM Imran, Modi\n", "excerpt": null, "time": null},
{"title": "Modi’s next move\n", "excerpt": null, "time": null},
{"title": "Pakistan takes up suspension of accounts 'posting in support of Kashmir' with Twitter, Facebook\n", "excerpt": null, "time": null},
{"title": "World must wake up to India’s nuke threat, says PM\n", "excerpt": null, "time": null},
{"title": "The unspoken reality\n", "excerpt": null, "time": null},
{"title": "Trump stresses need to reduce India-Pakistan tension in phone calls to PM Imran, Modi\n", "excerpt": null, "time": null},
{"title": "Modi’s next move\n", "excerpt": null, "time": null},
{"title": "Pakistan alarmed at Indian attitude over water treaty\n", "excerpt": null, "time": null},
{"title": "FM Qureshi expresses hope France will 'play its due role' on Kashmir issue\n", "excerpt": null, "time": null},
{"title": "Aid cut improved ties with Pakistan: Trump\n", "excerpt": null, "time": null},
{"title": "200 accounts suspended over Kashmir reported to Twitter\n", "excerpt": null, "time": null},
{"title": "Nobel laureate Amartya Sen slams decision to revoke occupied Kashmir's special status\n", "excerpt": null, "time": null}
][
{"title": "Pakistani astronaut, Namira Salim believes space diplomacy could create peach on Earth", "excerpt": "\"At the International Space Station, world leaders can begin thinking for humanity as a whole, transcending borders.\"", "time": "2019-08-22T08:30:00+05:00"},
{"title": "Editorial: It is clear that mere ‘procedural changes’ in NAB's workings aren't enough to restore business", "excerpt": "The government has conceded that the business community is anxious because of the investigations launched by the bureau.", "time": "2019-08-22T08:25:21+05:00"},
{"title": "One year on, PTI govt keeps shifting focus from crisis to crisis without solving them", "excerpt": "Devaluation, inflation, high interest rates and all the medicine the doctor ordered are now in full swing.", "time": "2019-08-22T08:05:26+05:00"},
{"title": "Brazil’s president blames NGOs for Amazon fire", "excerpt": "Bolsonaro says \"everything indicates\" that NGOs are going to the Amazon to \"set fire\" to the forest.", "time": "2019-08-22T08:30:32+05:00"},
{"title": "Demos planned in NY during Modi’s visit", "excerpt": "PM Imran has issued directives to PTI’s foreign chapters to prepare to stage a protest in New York on Modi’s arrival.", "time": "2019-08-22T08:24:39+05:00"},
{"title": "Bill for increase in Balochistan’s NA, PA seats due in Senate soon", "excerpt": "Senate Chairman Muhammad Sadiq Sanjrani says consultation with all political parties over the issue is underway.", "time": "2019-08-22T07:55:50+05:00"},
{"title": "NAB starts referring petty cases to other authorities", "excerpt": "The government recently asked the anti-graft watchdog to deal only with mega corruption cases.", "time": "2019-08-22T07:59:40+05:00"},
{"title": "PBC moves SC over SJC case against judge", "excerpt": "The present petition is the fourth petition challenging the filing of the reference against Justice Qazi Faez Isa.", "time": "2019-08-22T07:45:46+05:00"},
{"title": "US lawmakers urge India to end occupation of Kashmir", "excerpt": "\"Prime Minister Modi should know better. We all must raise our voices,\" says Congresswoman Yvette Clarke of New York.", "time": "2019-08-22T08:06:47+05:00"},
{"title": "Alarmed at polio cases surge, Imran to lead drive himself", "excerpt": "PM’s Focal Person on Polio Eradication says parents mark their children's fingers themselves to avoid vaccination.", "time": "2019-08-22T07:07:20+05:00"},
{"title": "NAB to be stripped of powers to probe private citizens: minister", "excerpt": "Farogh Nasim says businesspersons should be subject to laws of the FBR and FIA.", "time": "2019-08-22T07:07:20+05:00"},
{"title": "Another hurdle crossed as FATF meetings loom", "excerpt": "A senior level delegation from Pakistan led by Dr Reza Baqir attended the Asia-Pacific Group meeting in Canberra.", "time": "2019-08-22T07:30:24+05:00"},
{"title": "US drone shot down over Yemen: officials", "excerpt": "Losing a drone expensive but unlikely to lead to any major response by the United States, says one official.", "time": "2019-08-22T00:55:41+05:00"},
{"title": "India's ex-finance minister arrested in dramatic raid at his home", "excerpt": "Chidambaram has been charged in relation to alleged kickbacks and money laundering involving a media company.", "time": "2019-08-22T00:44:38+05:00"},
{"title": "Sudan swears in civilian-majority ruling council", "excerpt": "It is the first time that Sudan is not under full military rule since Bashir's coup d'etat in 1989.", "time": "2019-08-22T00:12:52+05:00"},
{"title": "Iran moves to strike 4 zeroes from its battered currency", "excerpt": "President Rouhani sends bill to parliament which has until 2021 to decide on creating a new currency, the 'toman'.", "time": "2019-08-21T23:33:56+05:00"},
{"title": "Yemeni govt says will not talk to separatists until standoff ends", "excerpt": "Saudi Arabia, leader of a military coalition that includes the separatists, calls for a summit.", "time": "2019-08-21T21:26:03+05:00"},
{"title": "Families demand answers for 'unaccounted for' deaths in occupied Kashmir", "excerpt": "“The police officer threatened he will throw the body into the river if we talk to media or try to make a procession.”", "time": "2019-08-22T08:30:54+05:00"},
{"title": "US tariffs on China won't fix trade deficit, IMF economists say", "excerpt": "“Higher bilateral tariffs are unlikely to reduce trade imbalances, as they mainly divert trade to other countries.”", "time": "2019-08-21T20:24:11+05:00"},
{"title": "Telenor Pakistan offers to pay $224.6m for licence renewal", "excerpt": "Telecommunication company says licence renewal faces delay \"due to unfair demands on pricing and rollout obligations\".", "time": "2019-08-21T19:27:55+05:00"},
{"title": "PM Imran expresses serious concern over spike in polio cases", "excerpt": "Directs officials to undertake effective awareness and immunisation campaigns so the disease can be kept in check.", "time": "2019-08-21T19:42:21+05:00"},
{"title": "PCB's new constitution comes into effect after cabinet approval", "excerpt": "2019 constitution splits the office of chairman and chief executive and introduces new structure for domestic cricket.", "time": "2019-08-21T20:39:34+05:00"},
{"title": "Taylor Swift helps a Pakistani student in Canada by sending her $6,386.47", "excerpt": "Ayesha Khurram can now carry on her education in Ontario University thanks to the singer.", "time": "2019-08-21T18:40:58+05:00"},
{"title": "APG reviews Pakistan's 3rd Mutual Evaluation Report on anti-money laundering measures", "excerpt": "Pakistan is taking measures to exit the 'grey list' of FATF by the mid of October.", "time": "2019-08-21T18:05:54+05:00"},
{"title": "Did Chetan Bhagat just reduce mass detentions in occupied Kashmir to a math problem?", "excerpt": "The fiction writer also recommended economic policy for the occupied region but Twitter wasn't having it.", "time": "2019-08-21T16:47:50+05:00"},
{"title": "Qandeel Baloch's parents announce pardon for sons, urge court to wrap up murder case", "excerpt": "Affidavit says the anti-honour killing law was passed after Qandeel's murder and cannot be applied to her murder case.", "time": "2019-08-21T17:00:48+05:00"},
{"title": "Is education a priority for the PTI?", "excerpt": "The government is yet to have an implementable policy on the matter.", "time": "2019-08-21T16:35:45+05:00"},
{"title": "Just lots of pictures from Hasan Ali's wedding reception", "excerpt": "The cricketer is now officially married to Samiya Arzoo, an Indian national based in Dubai.", "time": "2019-08-21T15:21:09+05:00"},
{"title": "Pakistan cricket team to tour England next year; Tests to be part of world championship", "excerpt": "The five-week long tour starting from July 3, 2020, will include three Test matches and three T20I matches.", "time": "2019-08-21T14:35:26+05:00"},
{"title": "Saudi Arabia eases travel restrictions on women", "excerpt": "The reform, which came into effect on Tuesday, weakens the restrictive guardianship system.", "time": "2019-08-21T14:45:15+05:00"},
{"title": "Remove Priyanka Chopra as Goodwill Ambassador, Shireen Mazari writes to Unicef chief", "excerpt": "Chopra's jingoism, support for war go against principles of peace and goodwill that she is supposed to uphold: minister", "time": "2019-08-21T15:00:29+05:00"},
{"title": "Modi complains to Boris about occupied Kashmir protests outside India's London HC", "excerpt": "Indian premier says vested interests were pursuing their agenda with violent means.", "time": "2019-08-21T23:05:23+05:00"},
{"title": "Matrix 4 is officially a go and Keanu Reeves will return as Neo", "excerpt": "Carrie-Anne Moss will also reprise her role as Trinity in the fourth installment of the series.", "time": "2019-08-21T13:12:44+05:00"},
{"title": "Death toll from Afghan wedding blast rises to 80: officials", "excerpt": "The initial death toll after the blast was 63 but some of the wounded died in hospital, says Nasrat Rahimi.", "time": "2019-08-21T12:43:33+05:00"},
{"title": "Two killed in gunbattle in occupied Kashmir: police", "excerpt": "The clash was the first to be reported by the authorities since India revoked occupied Kashmir's autonomy on August 5.", "time": "2019-08-21T12:15:28+05:00"},
{"title": "NAB granted 14-day extension in remand for Maryam Nawaz, Yousuf Abbas", "excerpt": "The two were first remanded into NAB custody following their arrest on August 8.", "time": "2019-08-21T12:14:44+05:00"},
{"title": "Is Hamza Ali Abbasi tying the knot with Naimal Khawar?", "excerpt": "If the rumours are true, the two will get hitched this Sunday.", "time": "2019-08-21T11:39:37+05:00"},
{"title": "Denmark stunned as Trump scraps visit over Greenland snub", "excerpt": "Danish PM Mette Frederiksen “annoyed and surprised” at Trump's decision, but insists US-Danish relations remain strong.", "time": "2019-08-21T20:56:41+05:00"},
{"title": "Uber-rival Bolt enters European food delivery business", "excerpt": "Bolt has grabbed business from Uber mostly in major African cities and Eastern Europe.", "time": "2019-08-21T10:20:03+05:00"},
{"title": "This couple left the city life behind to open a tent and breakfast in Hunza", "excerpt": "With Khanabadosh Baithak, Ahmed and Baneen curate experiences for travellers who need a break from it all.", "time": "2019-08-21T12:11:05+05:00"},
{"title": "Editorial: Extension of Gen Bajwa's tenure — expected but still criticised", "excerpt": "Surely, the PTI government must try and live up to its own vision of itself as a powerful setup.", "time": "2019-08-21T08:03:20+05:00"},
{"title": "Scores of people evacuated in Kasur because of flooding in Sutlej", "excerpt": "The district administration had made announcements in villages near Kanganpur asking people to vacate the villages.", "time": "2019-08-21T09:07:09+05:00"},
{"title": "Khwaja brothers’ indictment put off over illegible reference copies", "excerpt": "During the previous hearing, an accountability court had delayed the indictment due to absence of Khwaja Saad.", "time": "2019-08-21T09:05:01+05:00"},
{"title": "Stocks storm past 30,000-level", "excerpt": "Bulls rampaged through the stock market for the second day in succession with the KSE-100 index.", "time": "2019-08-21T08:39:19+05:00"},
{"title": "FPCCI reiterates demand for refunds payment", "excerpt": "“This will lead to achieving the export target set for this fiscal year,” says FPCCI President Daroo Khan Achakzai.", "time": "2019-08-21T08:38:37+05:00"},
{"title": "Engro earnings jump 51pc", "excerpt": "Along with the results, the company announced cash dividend at Rs8 per share.", "time": "2019-08-21T08:37:42+05:00"},
{"title": "Spooked Trump insists US economy not in trouble", "excerpt": "Trump enters the 2020 campaign season facing significant headwinds — except on the economy.", "time": "2019-08-21T08:36:49+05:00"},
{"title": "Focus on boosting exports, says Razak", "excerpt": "Undertaking institutional reforms, documentation of economy, ease of doing business regulation priority for govt.", "time": "2019-08-21T08:36:00+05:00"},
{"title": "US sanctions on Huawei bite, but who gets hurt?", "excerpt": "Chinese technology giant Huawei has yet to feel the full force of US sanctions due to temporary exemptions.", "time": "2019-08-21T08:34:30+05:00"},
{"title": "PSX in throes of ‘correction’: SECP chief", "excerpt": "Vows no compromise on transparency.", "time": "2019-08-21T08:33:28+05:00"},
{"title": "Current account deficit  contracts 73pc in July", "excerpt": "This was in line with the downward trend witnessed throughout 2018-19 when the deficit stood lower by 31pc.", "time": "2019-08-21T10:03:48+05:00"},
{"title": "Second innings for Gen Bajwa", "excerpt": "The security situation may be a factor, but there have been more pressing reasons for the extension.", "time": "2019-08-21T09:50:52+05:00"},
{"title": "Water released as Tarbela Dam filled to capacity", "excerpt": "The reservoir touched its maximum storage capacity mark of 1,550 feet during early hours of Tuesday.", "time": "2019-08-21T09:09:20+05:00"},
{"title": "Beggars, transgender persons to sell cloth, paper bags", "excerpt": "Both segments of the society have been asked to sell paper and cloth bags at a point of their choice.", "time": "2019-08-21T09:08:43+05:00"},
{"title": "PTA raises accounts suspension with Twitter", "excerpt": "In the past Twitter has declined all requests for account information, blocking and removal of accounts.", "time": "2019-08-21T09:08:06+05:00"},
{"title": "92,000 cases of dog bite happened in Sindh till June 30: minister", "excerpt": "‘Controlling dog population is only solution to get rid of life-threatening rabies infection’", "time": "2019-08-21T07:07:15+05:00"},
{"title": "Death sentence of PTI leader’s killers commuted to life term", "excerpt": "Two MQM activists were sentenced to death last year by an ATC for killing Zahra Shahid in 2013.", "time": "2019-08-21T09:02:41+05:00"},
{"title": "UK ‘concerned’ by reports HK consulate employee detained in China", "excerpt": "Hong Kong police confirmed they had opened a missing person’s case on Aug 9.", "time": "2019-08-21T08:37:06+05:00"},
{"title": "Music legend Khayyam dies at 92", "excerpt": "His death marks the end of a grand musical era that saw legends weave magic with gentle notes in indelible patterns.", "time": "2019-08-21T08:46:17+05:00"},
{"title": "Russia has restarted sharing radiation data, says watchdog", "excerpt": "In his first comments on the explosion, President Vladimir Putin says that it hasn’t posed any radiation threat.", "time": "2019-08-21T08:41:17+05:00"},
{"title": "Alarmed at polio cases surge, Imran to lead drive himself", "excerpt": "PM’s Focal Person on Polio Eradication says parents mark their children's fingers themselves to avoid vaccination.", "time": "2019-08-22T07:07:20+05:00"},
{"title": "NAB to be stripped of powers to probe private citizens: minister", "excerpt": "Farogh Nasim says businesspersons should be subject to laws of the FBR and FIA.", "time": "2019-08-22T07:07:20+05:00"},
{"title": "NAB starts referring petty cases to other authorities", "excerpt": "The government recently asked the anti-graft watchdog to deal only with mega corruption cases.", "time": "2019-08-22T07:59:40+05:00"},
{"title": "Bill for increase in Balochistan’s NA, PA seats due in Senate soon", "excerpt": "Senate Chairman Muhammad Sadiq Sanjrani says consultation with all political parties over the issue is underway.", "time": "2019-08-22T07:55:50+05:00"},
{"title": "PBC moves SC over SJC case against judge", "excerpt": "The present petition is the fourth petition challenging the filing of the reference against Justice Qazi Faez Isa.", "time": "2019-08-22T07:45:46+05:00"},
{"title": "PM Imran expresses serious concern over spike in polio cases", "excerpt": "Directs officials to undertake effective awareness and immunisation campaigns so the disease can be kept in check.", "time": "2019-08-21T19:42:21+05:00"},
{"title": "Is govt protecting video tape scandal judge, wonders CJP", "excerpt": "The three-judge Supreme Court bench observes it will decide the fate of the petitions within two or three days.", "time": "2019-08-21T07:33:13+05:00"},
{"title": "Telenor Pakistan offers to pay $224.6m for licence renewal", "excerpt": "Telecommunication company says licence renewal faces delay \"due to unfair demands on pricing and rollout obligations\".", "time": "2019-08-21T19:27:55+05:00"},
{"title": "Nai Gaj dam construction cost tripled due to delay, Senate panel told", "excerpt": "Federal govt blames Sindh govt for financial delays while Sindh claims project revised on account of deferred payments.", "time": "2019-08-21T08:00:56+05:00"},
{"title": "One year on, PTI govt keeps shifting focus from crisis to crisis without solving them", "excerpt": "Devaluation, inflation, high interest rates and all the medicine the doctor ordered are now in full swing.", "time": "2019-08-22T08:05:26+05:00"},
{"title": "Pakistani astronaut, Namira Salim believes space diplomacy could create peach on Earth", "excerpt": "\"At the International Space Station, world leaders can begin thinking for humanity as a whole, transcending borders.\"", "time": "2019-08-22T08:30:00+05:00"},
{"title": "NAB granted 14-day extension in remand for Maryam Nawaz, Yousuf Abbas", "excerpt": "The two were first remanded into NAB custody following their arrest on August 8.", "time": "2019-08-21T12:14:44+05:00"},
{"title": "Remove Priyanka Chopra as Goodwill Ambassador, Shireen Mazari writes to Unicef chief", "excerpt": "Chopra's jingoism, support for war go against principles of peace and goodwill that she is supposed to uphold: minister", "time": "2019-08-21T15:00:29+05:00"},
{"title": "Scores of people evacuated in Kasur because of flooding in Sutlej", "excerpt": "The district administration had made announcements in villages near Kanganpur asking people to vacate the villages.", "time": "2019-08-21T09:07:09+05:00"},
{"title": "PTA raises accounts suspension with Twitter", "excerpt": "In the past Twitter has declined all requests for account information, blocking and removal of accounts.", "time": "2019-08-21T09:08:06+05:00"},
{"title": "Qandeel Baloch's parents announce pardon for sons, urge court to wrap up murder case", "excerpt": "Affidavit says the anti-honour killing law was passed after Qandeel's murder and cannot be applied to her murder case.", "time": "2019-08-21T17:00:48+05:00"},
{"title": "Tax notices issued to private schools, tuition centres", "excerpt": "FBR launches two digital apps for sales tax registration and sales tax invoice verifications.", "time": "2019-08-21T07:53:24+05:00"},
{"title": "Water released as Tarbela Dam filled to capacity", "excerpt": "The reservoir touched its maximum storage capacity mark of 1,550 feet during early hours of Tuesday.", "time": "2019-08-21T09:09:20+05:00"},
{"title": "Beggars, transgender persons to sell cloth, paper bags", "excerpt": "Both segments of the society have been asked to sell paper and cloth bags at a point of their choice.", "time": "2019-08-21T09:08:43+05:00"},
{"title": "Bill seeking to create new provinces referred to NA speaker", "excerpt": "The committee analysed the Constitution (Amendment) Bill, 2019 (Amendment in Articles 1, 51, 59, 106, 175A and 218).", "time": "2019-08-21T09:02:02+05:00"},
{"title": "Just lots of pictures from Hasan Ali's wedding reception", "excerpt": "The cricketer is now officially married to Samiya Arzoo, an Indian national based in Dubai.", "time": "2019-08-21T15:21:09+05:00"},
{"title": "Khwaja brothers’ indictment put off over illegible reference copies", "excerpt": "During the previous hearing, an accountability court had delayed the indictment due to absence of Khwaja Saad.", "time": "2019-08-21T09:05:01+05:00"},
{"title": "Is Hamza Ali Abbasi tying the knot with Naimal Khawar?", "excerpt": "If the rumours are true, the two will get hitched this Sunday.", "time": "2019-08-21T11:39:37+05:00"},
{"title": "92,000 cases of dog bite happened in Sindh till June 30: minister", "excerpt": "‘Controlling dog population is only solution to get rid of life-threatening rabies infection’", "time": "2019-08-21T07:07:15+05:00"},
{"title": "Death sentence of PTI leader’s killers commuted to life term", "excerpt": "Two MQM activists were sentenced to death last year by an ATC for killing Zahra Shahid in 2013.", "time": "2019-08-21T09:02:41+05:00"},
{"title": "India finally shares floodwater discharge data", "excerpt": "River Sutlej is expected to be in high flood today.", "time": "2019-08-21T07:36:10+05:00"},
{"title": "Cabinet mulls steps to rein in NAB over complaints by businessmen", "excerpt": "Dr Firdous Ashiq Awan observes that businessmen are afraid of NAB and are not investing their money.", "time": "2019-08-21T07:26:35+05:00"},
{"title": "Petition submitted in LHC to quash FIRs against Hafiz Saeed, others", "excerpt": "High court is set to hear the petition submitted by a top JuD leader, Malik Zafar Iqbal, on Thursday.", "time": "2019-08-20T18:56:05+05:00"},
{"title": "SC reserves verdict on petitions regarding judge Arshad Malik video scandal", "excerpt": "Will decide whether to form an inquiry committee or a judicial commission to probe the matter further.", "time": "2019-08-20T21:44:30+05:00"},
{"title": "‘CPEC Authority’ being set up for timely completion of projects: PM", "excerpt": "\"The completion of CPEC will not only benefit Pakistan and China, but also the entire region,\" says the prime minister.", "time": "2019-08-20T08:17:25+05:00"},
{"title": "Pakistan to take Kashmir dispute with India to International Court of Justice", "excerpt": "“The decision was taken after considering all legal aspects,”  says Foreign Minister Qureshi.", "time": "2019-08-20T20:36:26+05:00"},
{"title": "Editorial: Extension of Gen Bajwa's tenure — expected but still criticised", "excerpt": "Surely, the PTI government must try and live up to its own vision of itself as a powerful setup.", "time": "2019-08-21T08:03:20+05:00"},
{"title": "Second innings for Gen Bajwa", "excerpt": "The security situation may be a factor, but there have been more pressing reasons for the extension.", "time": "2019-08-21T09:50:52+05:00"},
{"title": "'Genocide underway in occupied Kashmir,' warns AJK president", "excerpt": "Urges UNSC to take up Indian atrocities and Kashmir's right to self determination in an open session.", "time": "2019-08-20T15:33:38+05:00"},
{"title": "Pakistan alarmed at Indian attitude over water treaty", "excerpt": "Vawda says under the accord New Delhi is obligated to provide information about 'extraordinary flood' to Pakistan.", "time": "2019-08-20T07:40:49+05:00"},
{"title": "Another hurdle crossed as FATF meetings loom", "excerpt": "A senior level delegation from Pakistan led by Dr Reza Baqir attended the Asia-Pacific Group meeting in Canberra.", "time": "2019-08-22T07:30:24+05:00"},
{"title": "Iran moves to strike 4 zeroes from its battered currency", "excerpt": "President Rouhani sends bill to parliament which has until 2021 to decide on creating a new currency, the 'toman'.", "time": "2019-08-21T23:33:56+05:00"},
{"title": "US tariffs on China won't fix trade deficit, IMF economists say", "excerpt": "“Higher bilateral tariffs are unlikely to reduce trade imbalances, as they mainly divert trade to other countries.”", "time": "2019-08-21T20:24:11+05:00"},
{"title": "Telenor Pakistan offers to pay $224.6m for licence renewal", "excerpt": "Telecommunication company says licence renewal faces delay \"due to unfair demands on pricing and rollout obligations\".", "time": "2019-08-21T19:27:55+05:00"},
{"title": "Tax notices issued to private schools, tuition centres", "excerpt": "FBR launches two digital apps for sales tax registration and sales tax invoice verifications.", "time": "2019-08-21T07:53:24+05:00"},
{"title": "Current account deficit  contracts 73pc in July", "excerpt": "This was in line with the downward trend witnessed throughout 2018-19 when the deficit stood lower by 31pc.", "time": "2019-08-21T10:03:48+05:00"},
{"title": "Focus on boosting exports, says Razak", "excerpt": "Undertaking institutional reforms, documentation of economy, ease of doing business regulation priority for govt.", "time": "2019-08-21T08:36:00+05:00"},
{"title": "Spooked Trump insists US economy not in trouble", "excerpt": "Trump enters the 2020 campaign season facing significant headwinds — except on the economy.", "time": "2019-08-21T08:36:49+05:00"},
{"title": "PSX in throes of ‘correction’: SECP chief", "excerpt": "Vows no compromise on transparency.", "time": "2019-08-21T08:33:28+05:00"},
{"title": "Editorial: It is clear that mere ‘procedural changes’ in NAB's workings aren't enough to restore business", "excerpt": "The government has conceded that the business community is anxious because of the investigations launched by the bureau.", "time": "2019-08-22T08:25:21+05:00"},
{"title": "Three reviews to determine Pakistan’s place on FATF list", "excerpt": "Pakistan has submitted a compliance report on a 27-point action plan committed with the FATF to the Asia-Pacific Group.", "time": "2019-08-21T17:21:47+05:00"},
{"title": "Stocks storm past 30,000-level", "excerpt": "Bulls rampaged through the stock market for the second day in succession with the KSE-100 index.", "time": "2019-08-21T08:39:19+05:00"},
{"title": "FPCCI reiterates demand for refunds payment", "excerpt": "“This will lead to achieving the export target set for this fiscal year,” says FPCCI President Daroo Khan Achakzai.", "time": "2019-08-21T08:38:37+05:00"},
{"title": "Engro earnings jump 51pc", "excerpt": "Along with the results, the company announced cash dividend at Rs8 per share.", "time": "2019-08-21T08:37:42+05:00"},
{"title": "UAE business tycoon Lootah turns approver against Zardari", "excerpt": "The top businessman is one of the accused persons in the fake accounts case.", "time": "2019-08-20T07:45:40+05:00"},
{"title": "Huawei dismisses new suspension of 'unjust' US ban", "excerpt": "\"Attempts to suppress Huawei's business won't help the United States achieve technological leadership,\" Huawei said.", "time": "2019-08-20T16:50:08+05:00"},
{"title": "UK, EU harden their positions on Brexit as G7 approaches", "excerpt": "Irish premier, after a one-hour call with Johnson, said the Brexit deal wouldn’t be renegotiated.", "time": "2019-08-20T16:48:39+05:00"},
{"title": "‘CPEC Authority’ being set up for timely completion of projects: PM", "excerpt": "\"The completion of CPEC will not only benefit Pakistan and China, but also the entire region,\" says the prime minister.", "time": "2019-08-20T08:17:25+05:00"},
{"title": "Johnson tells Germany and France: do a Brexit deal", "excerpt": "\"We will be ready to come out on Oct 31 — deal or no deal,\" Johnson tells reporters in Truro, southwest England.", "time": "2019-08-20T08:45:26+05:00"},
{"title": "US sanctions on Huawei bite, but who gets hurt?", "excerpt": "Chinese technology giant Huawei has yet to feel the full force of US sanctions due to temporary exemptions.", "time": "2019-08-21T08:34:30+05:00"},
{"title": "Big industry contracts 3.6pc in FY19", "excerpt": "In June, the last month of the outgoing fiscal year, the big industry posted a negative growth of 5.05pc.", "time": "2019-08-20T08:21:45+05:00"},
{"title": "Stocks bounce back with a 798-point rally", "excerpt": "“One swallow does not make a summer,” says a veteran.", "time": "2019-08-20T08:31:45+05:00"},
{"title": "Car sales plunge by 42pc in July", "excerpt": "The key contributor to this lower production was the closure of production by Honda Atlas Cars.", "time": "2019-08-20T08:22:41+05:00"},
{"title": "Tough measures hampering dollar buying", "excerpt": "Currency dealers said the dollar buying has drastically dropped these days due to strict documentation.", "time": "2019-08-20T08:23:08+05:00"},
{"title": "Regulations for employees’ contributory funds notified", "excerpt": "The regulations do not apply to a pension funds which are governed under Voluntary Pension Systems Rules 2005.", "time": "2019-08-20T08:28:36+05:00"},
{"title": "India eases condition for shadow lenders", "excerpt": "The non-banking finance companies, also known as shadow lenders, have been battling a credit crunch since 2018.", "time": "2019-08-20T08:26:23+05:00"},
{"title": "Greek PM on EU tour to soften fiscal targets", "excerpt": "Mitsotakis will begin his meetings with a trip to Paris on Thursday.", "time": "2019-08-20T08:24:32+05:00"},
{"title": "US grants Huawei another 90 days to buy from American suppliers", "excerpt": "Authorities say the extension is intended to afford consumers necessary time to transition away from Huawei equipment.", "time": "2019-08-19T23:02:25+05:00"},
{"title": "German economy could continue to shrink: Bundesbank report", "excerpt": "Central bank of Federal Republic of Germany's report suggests that euro zone's biggest economy is now in a recession.", "time": "2019-08-19T16:40:31+05:00"},
{"title": "US economists expect recession in 2020 or 2021: survey", "excerpt": "Economists skeptical about a resolution to Trump's trade wars, although 64pc said a \"superficial agreement is possible\".", "time": "2019-08-19T21:58:12+05:00"},
{"title": "1,320MW coal-fired Hub power plant commissioned", "excerpt": "The plant will be set up by the China Power Hub Generation Company (CPHGC) under the CPEC project.", "time": "2019-08-19T07:01:51+05:00"},
{"title": "NAB shouldn’t move against bureaucrats on its own: task forces", "excerpt": "Supervisory bodies recommended at federal, provincial levels to decide if there is sufficient evidence against suspects.", "time": "2019-08-19T09:04:13+05:00"},
{"title": "Production from two major gas fields stopped", "excerpt": "The output from another was drastically cut to ensure smooth flow of expensive, imported LNG into the gas network.", "time": "2019-08-19T07:33:02+05:00"},
{"title": "Trump dismisses worries of recession, says economy is strong", "excerpt": "\"I don't think we're having a recession,\" Trump tells reporters.", "time": "2019-08-19T11:17:22+05:00"},
{"title": "Inflation may erode PTI’s political capital", "excerpt": "The government has so far not been able to keep inflation in check even for people in the lowest income group.", "time": "2019-08-19T08:10:46+05:00"},
{"title": "US lawmakers urge India to end occupation of Kashmir", "excerpt": "\"Prime Minister Modi should know better. We all must raise our voices,\" says Congresswoman Yvette Clarke of New York.", "time": "2019-08-22T08:06:47+05:00"},
{"title": "Brazil’s president blames NGOs for Amazon fire", "excerpt": "Bolsonaro says \"everything indicates\" that NGOs are going to the Amazon to \"set fire\" to the forest.", "time": "2019-08-22T08:30:32+05:00"},
{"title": "Demos planned in NY during Modi’s visit", "excerpt": "PM Imran has issued directives to PTI’s foreign chapters to prepare to stage a protest in New York on Modi’s arrival.", "time": "2019-08-22T08:24:39+05:00"},
{"title": "India's ex-finance minister arrested in dramatic raid at his home", "excerpt": "Chidambaram has been charged in relation to alleged kickbacks and money laundering involving a media company.", "time": "2019-08-22T00:44:38+05:00"},
{"title": "US drone shot down over Yemen: officials", "excerpt": "Losing a drone expensive but unlikely to lead to any major response by the United States, says one official.", "time": "2019-08-22T00:55:41+05:00"},
{"title": "Sudan swears in civilian-majority ruling council", "excerpt": "It is the first time that Sudan is not under full military rule since Bashir's coup d'etat in 1989.", "time": "2019-08-22T00:12:52+05:00"},
{"title": "Yemeni govt says will not talk to separatists until standoff ends", "excerpt": "Saudi Arabia, leader of a military coalition that includes the separatists, calls for a summit.", "time": "2019-08-21T21:26:03+05:00"},
{"title": "Modi complains to Boris about occupied Kashmir protests outside India's London HC", "excerpt": "Indian premier says vested interests were pursuing their agenda with violent means.", "time": "2019-08-21T23:05:23+05:00"},
{"title": "Iran moves to strike 4 zeroes from its battered currency", "excerpt": "President Rouhani sends bill to parliament which has until 2021 to decide on creating a new currency, the 'toman'.", "time": "2019-08-21T23:33:56+05:00"},
{"title": "US tariffs on China won't fix trade deficit, IMF economists say", "excerpt": "“Higher bilateral tariffs are unlikely to reduce trade imbalances, as they mainly divert trade to other countries.”", "time": "2019-08-21T20:24:11+05:00"},
{"title": "Denmark stunned as Trump scraps visit over Greenland snub", "excerpt": "Danish PM Mette Frederiksen “annoyed and surprised” at Trump's decision, but insists US-Danish relations remain strong.", "time": "2019-08-21T20:56:41+05:00"},
{"title": "Pakistani astronaut, Namira Salim believes space diplomacy could create peach on Earth", "excerpt": "\"At the International Space Station, world leaders can begin thinking for humanity as a whole, transcending borders.\"", "time": "2019-08-22T08:30:00+05:00"},
{"title": "Saudi Arabia eases travel restrictions on women", "excerpt": "The reform, which came into effect on Tuesday, weakens the restrictive guardianship system.", "time": "2019-08-21T14:45:15+05:00"},
{"title": "Death toll from Afghan wedding blast rises to 80: officials", "excerpt": "The initial death toll after the blast was 63 but some of the wounded died in hospital, says Nasrat Rahimi.", "time": "2019-08-21T12:43:33+05:00"},
{"title": "Remove Priyanka Chopra as Goodwill Ambassador, Shireen Mazari writes to Unicef chief", "excerpt": "Chopra's jingoism, support for war go against principles of peace and goodwill that she is supposed to uphold: minister", "time": "2019-08-21T15:00:29+05:00"},
{"title": "Two killed in gunbattle in occupied Kashmir: police", "excerpt": "The clash was the first to be reported by the authorities since India revoked occupied Kashmir's autonomy on August 5.", "time": "2019-08-21T12:15:28+05:00"},
{"title": "Trump to discuss Kashmir mediation with Modi", "excerpt": "\"I think, we are helping (resolve the tense) situation\" between India and Pakistan, says Trump.", "time": "2019-08-21T07:40:54+05:00"},
{"title": "Rohingya Muslims in Bangladesh say they don’t want to return home", "excerpt": "Some Rohingya interviewed by officials on Tuesday say they will not return unless Myanmar gives them citizenship.", "time": "2019-08-21T08:15:07+05:00"},
{"title": "Uber-rival Bolt enters European food delivery business", "excerpt": "Bolt has grabbed business from Uber mostly in major African cities and Eastern Europe.", "time": "2019-08-21T10:20:03+05:00"},
{"title": "Anti-Assad fighters withdraw from key Idlib area", "excerpt": "Turkey’s Foreign Minister Mevlut Cavusoglu says his country has no intention to move the post from Morek.", "time": "2019-08-21T08:29:08+05:00"},
{"title": "Taylor Swift helps a Pakistani student in Canada by sending her $6,386.47", "excerpt": "Ayesha Khurram can now carry on her education in Ontario University thanks to the singer.", "time": "2019-08-21T18:40:58+05:00"},
{"title": "Did Chetan Bhagat just reduce mass detentions in occupied Kashmir to a math problem?", "excerpt": "The fiction writer also recommended economic policy for the occupied region but Twitter wasn't having it.", "time": "2019-08-21T16:47:50+05:00"},
{"title": "Desperate migrants jump off rescue ship to reach Italy’s shores", "excerpt": "Open Arms describes the situation on board as \"out of control\" and \"desperate\".", "time": "2019-08-21T08:16:45+05:00"},
{"title": "UK ‘concerned’ by reports HK consulate employee detained in China", "excerpt": "Hong Kong police confirmed they had opened a missing person’s case on Aug 9.", "time": "2019-08-21T08:37:06+05:00"},
{"title": "Singapore to begin public test of driverless buses", "excerpt": "Consumers will use an app on their phones to book the shuttles.", "time": "2019-08-21T08:16:05+05:00"},
{"title": "Matrix 4 is officially a go and Keanu Reeves will return as Neo", "excerpt": "Carrie-Anne Moss will also reprise her role as Trinity in the fourth installment of the series.", "time": "2019-08-21T13:12:44+05:00"},
{"title": "Russia has restarted sharing radiation data, says watchdog", "excerpt": "In his first comments on the explosion, President Vladimir Putin says that it hasn’t posed any radiation threat.", "time": "2019-08-21T08:41:17+05:00"},
{"title": "Yemen separatists drive out govt troops from two bases in south", "excerpt": "A commander in the Security Belt Forces says \"we are controlling both camps now\".", "time": "2019-08-21T08:45:04+05:00"},
{"title": "Confiscated Beijing skyscraper sold via online auction", "excerpt": "More than 145,000 internet users followed the auction, but only two bids were cast.", "time": "2019-08-21T08:17:48+05:00"},
{"title": "Music legend Khayyam dies at 92", "excerpt": "His death marks the end of a grand musical era that saw legends weave magic with gentle notes in indelible patterns.", "time": "2019-08-21T08:46:17+05:00"},
{"title": "US urges India to free detainees, restore rights in occupied Kashmir", "excerpt": "Trump reiterates offer to mediate the “explosive” situation in Kashmir.", "time": "2019-08-21T02:22:47+05:00"},
{"title": "Facebook launches tool to let users control data flow", "excerpt": "The tool is to give clients access to their so-called \"off-Facebook activity\" and give them the option of deleting it.", "time": "2019-08-21T08:32:48+05:00"},
{"title": "India finally shares floodwater discharge data", "excerpt": "River Sutlej is expected to be in high flood today.", "time": "2019-08-21T07:36:10+05:00"},
{"title": "FM Qureshi expresses hope France will 'play its due role' on Kashmir issue", "excerpt": "Briefs French counterpart on \"illegal action by India\"; French President Macron to discuss Kashmir with Modi this week.", "time": "2019-08-21T01:03:29+05:00"},
{"title": "'IS still strong in some areas': Pompeo says in CBS interview", "excerpt": "US state secretary talks about IS, Iran, China and North Korea in wide-ranging interviews.", "time": "2019-08-20T20:06:50+05:00"},
{"title": "PCB's new constitution comes into effect after cabinet approval", "excerpt": "2019 constitution splits the office of chairman and chief executive and introduces new structure for domestic cricket.", "time": "2019-08-21T20:39:34+05:00"},
{"title": "Pakistan cricket team to tour England next year; Tests to be part of world championship", "excerpt": "The five-week long tour starting from July 3, 2020, will include three Test matches and three T20I matches.", "time": "2019-08-21T14:35:26+05:00"},
{"title": "Misbah, Rashid among panel to review selection of provincial teams", "excerpt": "It may be mentioned that Misbah has already been appointed as camp-commandant of the pre-season Pakistan camp.", "time": "2019-08-21T08:45:00+05:00"},
{"title": "Concussed Smith ruled out of third Test", "excerpt": "The 30-year-old was felled by a Jofra Archer bouncer on Saturday in the first innings of the second Test at Lord’s.", "time": "2019-08-21T08:43:08+05:00"},
{"title": "Waugh wowed by Archer’s X-factor credentials", "excerpt": "Archer made his Test debut in the drawn second match at Lord’s.", "time": "2019-08-21T08:43:59+05:00"},
{"title": "Williamson, Dananjaya reported for suspect action", "excerpt": "While Williamson is a part-time spinner who bowled only three overs, Dananjaya bowled 62 overs in the match.", "time": "2019-08-21T08:57:26+05:00"},
{"title": "United held at Wolves after Pogba’s penalty woe", "excerpt": "After a 4-0 home win over Chelsea on the opening day, Ole Gunnar Solskjaer’s team dominated the early exchanges.", "time": "2019-08-21T08:57:52+05:00"},
{"title": "Star batsman Steve Smith ruled out of third Ashes Test after concussion", "excerpt": "He was unable to play on the fifth and final day on Sunday as he awoke feeling \"groggy\".", "time": "2019-08-20T16:24:50+05:00"},
{"title": "Azhar Mahmood feels coaching staff deserved chance to clarify position", "excerpt": "Azhar admitted fast bowler Mohammad Hasnain’s selection in the World Cup squad was a mistake.", "time": "2019-08-20T08:41:53+05:00"},
{"title": "Sharjeel apologises as PCB waives ban sentence", "excerpt": "Sharjeel was suspended from national and international cricket for five years by the PCB in 2017.", "time": "2019-08-20T08:42:36+05:00"},
{"title": "Mandatory neck guards not far off after Smith blow", "excerpt": "Australia have been at the forefront of pressing for better safety measures for players.", "time": "2019-08-20T08:43:23+05:00"},
{"title": "Archer’s sensational debut changes complexion of Ashes series", "excerpt": "The times on the speed gun kept on rising.", "time": "2019-08-20T08:40:17+05:00"},
{"title": "Medvedev breaks into top five at last", "excerpt": "The 23-year-old became the first Russian player in history to win a Masters title.", "time": "2019-08-20T08:35:02+05:00"},
{"title": "Prince Albert outpaces rivals to clinch Jashn-e-Azadi Cup", "excerpt": "The son of Denmark-bred sire Chapter One backed at 3-2 beat filly Sparking by two lengths.", "time": "2019-08-20T08:37:58+05:00"},
{"title": "PSG leave out Neymar again on way to shock Rennes defeat", "excerpt": "The visitors were gifted the opener when Edinson Cavani tapped in after a defensive mix-up.", "time": "2019-08-20T08:38:23+05:00"},
{"title": "Leipzig crush Union 4-0 to spoil newcomers’ Bundesliga debut", "excerpt": "RB Leipzig spoiled hosts Union Berlin’s .Bundesliga debut on Sunday.", "time": "2019-08-20T08:39:10+05:00"},
{"title": "Olympic gold medallist Zakir Hussain passes away at 85", "excerpt": "Hussain's funeral prayers will be carried out at his home town in Wah Cantt.", "time": "2019-08-19T14:36:36+05:00"},
{"title": "Mandatory neck guards 'not far away' after Smith felled by Archer", "excerpt": "Australia have been at the forefront of pressing for better safety measures after the death of Phillip Hughes.", "time": "2019-08-19T13:38:48+05:00"},
{"title": "Archer, Stokes give England advantage in Lord’s Test", "excerpt": "Australia were struggling at 46-2 in their second innings at tea on a compelling final day of the second Test.", "time": "2019-08-19T08:31:25+05:00"},
{"title": "ACA blasts English fans for booing injured Smith", "excerpt": "Smith was eventually able to walk off the field for concussion checks to a standing ovation.", "time": "2019-08-19T08:34:35+05:00"},
{"title": "Afghanistan board suspends Shahzad for one year", "excerpt": "Shahzad’s suspension stems from his breach of policy that requires players to seek permission before travelling abroad.", "time": "2019-08-19T08:36:03+05:00"},
{"title": "Chelsea held by Leicester, Sheffield United win", "excerpt": "Chelsea raced into a quick lead when the 20 year-old Mount stole the ball from a dallying Ndidi.", "time": "2019-08-19T08:32:08+05:00"},
{"title": "Australia hold out for second Test draw against England as concussed Smith sidelined", "excerpt": "Australia were 154-6 at the close, given a stiff target of 267 in 48 overs when England captain Joe Root declared.", "time": "2019-08-19T00:37:49+05:00"},
{"title": "New Zealand rugby team says World Cup more important than top ranking", "excerpt": "“We just need to get ourselves in the right frame of mind to go to the World Cup and win that,” says team coach.", "time": "2019-08-18T16:19:22+05:00"},
{"title": "Sri Lanka may consider  playing a Test on Pakistan  soil in October", "excerpt": "According to a report by *ESPNcricinfo*, the security delegation gave SLC “very positive feedback” upon its return.", "time": "2019-08-18T09:59:13+05:00"},
{"title": "Liverpool extend perfect start, Aubameyang inspires Arsenal as Pukki hits hat-trick", "excerpt": "The Reds’ confident start to the season puts pressure on champions Manchester City to respond with a second win.", "time": "2019-08-18T10:03:10+05:00"},
{"title": "Kaleemullah, Nasir Ali to join PHF selection committee", "excerpt": "The PHF had announced a four-member committee headed by Olympian Manzoor Junior.", "time": "2019-08-18T10:05:37+05:00"},
{"title": "Smith holds firm as Australia frustrate England in second Ashes Test", "excerpt": "Australia were 155-5 at lunch, having lost just one wicket in the session; hosts England scored 258 in first innings.", "time": "2019-08-17T18:10:19+05:00"},
{"title": "BD bring in Domingo as new head coach", "excerpt": "The 44-year-old has agreed to a two-year term with the BCB and is expected to arrive in Dhaka on Wednesday.", "time": "2019-08-18T10:12:48+05:00"},
{"title": "Foreign coaches cannot improve Pakistan cricket: Sarfraz Nawaz", "excerpt": "Former pacer also wants PCB to allow departmental teams to continue playing at least in one-day and T20 events.", "time": "2019-08-17T10:04:06+05:00"},
{"title": "Australia slump before rain cuts short play in Lord’s Test", "excerpt": "Australia lost three wickets for 11 runs en route to slumping to 80-4.", "time": "2019-08-17T10:00:35+05:00"},
{"title": "Battling Watling revives NZ hopes", "excerpt": "New Zealand, who trailed Sri Lanka by 18 runs in the first innings, finished on 195-7.", "time": "2019-08-17T10:00:53+05:00"},
{"title": "Big win sets Wolves up for Europa League playoff with Torino", "excerpt": "The winner of the home and away legs on August 22 and 29 will progress to the group stage.", "time": "2019-08-17T10:04:33+05:00"},
{"title": "Shastri wins close race to stay as India head coach", "excerpt": "Former India players Lalchand Rajput and Robin Singh were also short-listed candidates.", "time": "2019-08-17T10:02:02+05:00"},
{"title": "Back problem hampers Morgan’s desire for second World Cup success", "excerpt": "The 32-year-old Irishman had problems with his back during the drawn-out World Cup campaign.", "time": "2019-08-17T10:02:47+05:00"},
{"title": "Editorial: It is clear that mere ‘procedural changes’ in NAB's workings aren't enough to restore business\n", "excerpt": null, "time": null},
{"title": "One year on, PTI govt keeps shifting focus from crisis to crisis without solving them\n", "excerpt": null, "time": null},
{"title": "Families demand answers for 'unaccounted for' deaths in occupied Kashmir\n", "excerpt": null, "time": null},
{"title": "Editorial: Extension of Gen Bajwa's tenure — expected but still criticised\n", "excerpt": null, "time": null},
{"title": "Pakistani astronaut, Namira Salim believes space diplomacy could create peach on Earth\n", "excerpt": null, "time": null},
{"title": "Modi’s next move\n", "excerpt": null, "time": null},
{"title": "Patriotism vs commercial interests\n", "excerpt": null, "time": null},
{"title": "Flood alert issued for River Sutlej, Indus after India releases water 'without preschedule'\n", "excerpt": null, "time": null},
{"title": "Trump stresses need to reduce India-Pakistan tension in phone calls to PM Imran, Modi\n", "excerpt": null, "time": null},
{"title": "Pakistan to take Kashmir dispute with India to International Court of Justice\n", "excerpt": null, "time": null},
{"title": "World must wake up to India’s nuke threat, says PM\n", "excerpt": null, "time": null},
{"title": "Army chief Gen Bajwa's tenure extended for another 3 years\n", "excerpt": null, "time": null},
{"title": "The unspoken reality\n", "excerpt": null, "time": null},
{"title": "Modi’s next move\n", "excerpt": null, "time": null},
{"title": "Patriotism vs commercial interests\n", "excerpt": null, "time": null},
{"title": "Flood alert issued for River Sutlej, Indus after India releases water 'without preschedule'\n", "excerpt": null, "time": null},
{"title": "Trump stresses need to reduce India-Pakistan tension in phone calls to PM Imran, Modi\n", "excerpt": null, "time": null},
{"title": "Pakistan to take Kashmir dispute with India to International Court of Justice\n", "excerpt": null, "time": null},
{"title": "Pakistan takes up suspension of accounts 'posting in support of Kashmir' with Twitter, Facebook\n", "excerpt": null, "time": null},
{"title": "World must wake up to India’s nuke threat, says PM\n", "excerpt": null, "time": null},
{"title": "Army chief Gen Bajwa's tenure extended for another 3 years\n", "excerpt": null, "time": null},
{"title": "Trump to discuss Kashmir mediation with Modi\n", "excerpt": null, "time": null},
{"title": "Remove Priyanka Chopra as Goodwill Ambassador, Shireen Mazari writes to Unicef chief\n", "excerpt": null, "time": null},
{"title": "Qandeel Baloch's parents announce pardon for sons, urge court to wrap up murder case\n", "excerpt": null, "time": null},
{"title": "Trump’s efforts\n", "excerpt": null, "time": null},
{"title": "Modi complains to Boris about occupied Kashmir protests outside India's London HC\n", "excerpt": null, "time": null},
{"title": "India finally shares floodwater discharge data\n", "excerpt": null, "time": null},
{"title": "Tax notices issued to private schools, tuition centres\n", "excerpt": null, "time": null},
{"title": "NAB granted 14-day extension in remand for Maryam Nawaz, Yousuf Abbas\n", "excerpt": null, "time": null}
]